import java.util.Scanner;

public class Start7 {
    public static void main(String[] args) {
//        Scanner sc = new Scanner(System.in);
//        System.out.println("Сколько чисел вы хотите ввести");
//        int n = sc.nextInt();
//        while (n > 0){
//            System.out.println("введите целое число: ");
//            int k = sc.nextInt();
//            System.out.println("ваше число в квадрате: " + (k * k));
//
//
//        }
        Scanner sc = new Scanner(System.in);
        System.out.println("введите год Вашего рождения ?");
        int a = sc.nextInt();
        System.out.println("введите какой сегодня год ? ");
        int b = sc.nextInt();
        System.out.println("вам " + (b - a) + " лет!");





    }
}
